{
  "Items": [
    {
      "Action": {
        "Route": "/releases/heart",
        "Text": "View 'HEART'"
      },
      "Author": "Viii",
      "Content": "<p></p>",
      "CreatedAt": "2018-11-15T00:00:00",
      "Excerpt": "The debut EP 'HEART' has now been released.",
      "ImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/debut-ep-heart-released.jpg",
      "IsActive": "y",
      "OgImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/og/debut-ep-heart-released.jpg",
      "Slug": "debut-ep-heart-released",
      "Title": "Debut EP 'HEART' released",
      "Type": "release"
    },
    {
      "Title": "New website launched",
      "Author": "Viii",
      "Excerpt": "The new official Viii website is now live!",
      "ImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/new-website-launched.jpg",
      "Content": "<p>The brand new official Viii website is now live!</p><p>The new site features a fully responsive design for viewing on all mobile devices, as well as desktop browsers, plus an all-new news section, releases section and an appearances section for upcoming shows.</p><p>Stay tuned for more features to be released in the near future.</p>",
      "OgImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/og/new-website-launched.jpg",
      "Slug": "new-website-launched",
      "IsActive": "y",
      "Type": "news",
      "CreatedAt": "2018-06-20T21:20:00"
    },
    {
      "Title": "Single 'Threadfear / Ask Me to Stay' released",
      "Author": "Viii",
      "Excerpt": "New single 'Threadfear' released with accompanying B-side, 'Ask Me to Stay'.",
      "ImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/single-threadfear-ask-me-to-stay-released.jpg",
      "Content": "<p>\nThe producer of goth-toned electronica known as Viii has released his most recent pair of singles, “Threadfear / Ask Me to Stay.” The twin release has been proudly published on the Voodoo Creation Records independent music label without the direction of the corporate music industry. Pensive, brooding and thrumming with dark energy, “Threadfear / Ask Me to Stay” is the newest reason for fans of electronica to take note of this ever-rising artist from New Zealand.\n</p>\n<p>\nViii (pronounced Vee) cites as main artistic influences Maynard James Keenan (Tool, A Perfect Circle) Crosses, Banks, Nine Inch Nails, Portishead, Massive Attack, and Prince. His own bleak, yet lush and high-tech style will appeal to fans of these, perhaps particularly where Massive Attack and the Bristol sound are concerned.\n</p>\n<p>\nIn keeping with his ongoing tradition, the B-side of “Threadfear / Ask Me to Stay” is a cover by Etta Bond and Raf Riley with additional lyrics by Viii, himself.\n</p>\n<p>\n“I wanted to cover one of Etta’s songs because her music has helped me through many difficult times,” writes Viii, “especially with heartbreak. It seemed like a fitting choice for this to accompany Threadfear.”\n</p>\n<p>\n“Threadfear,” the original half of the release, stands tall amid the rest of Viii’s repertoire, popular and successful though they have been. Viii has described it as “a conversation held in both the past and present.”\n</p>\n<p>\n“The first verse/chorus speaks about being aware of issues within self when entering a relationship and asking for understanding around them,” Viii writes. “But then the partner preys upon them and leaves behind further issues. The second verse/chorus jumps ahead in time and speaks about how the issues left by the past relationship have caused problems in relationships since the one previously mentioned.”\n</p>\n<p>\nBoth at his home nation of New Zealand and abroad, Viii has a reputation for taking characteristics from his eclectic musical background and creating a broad palette with them to paint interesting and unique sonic imagery.\n</p>\n<p>\n“Threadfear / Ask Me to Stay” by Viii on Voodoo Creation Records is available from over 600 quality digital music retailers online worldwide now. Get in early, goth-electronica fans.\n</p>\n<p>\n-S. McCauley<br />\nLead Press Release Writer<br />\nMondoTunes\n</p>\n<p><a href=\"/releases/threadfear-ask-me-to-stay\">View the single details here</a>.</p>",
      "OgImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/og/single-threadfear-ask-me-to-stay-released.jpg",
      "Slug": "single-threadfear-ask-me-to-stay-released",
      "IsActive": "y",
      "Type": "release",
      "Action": {
        "Text": "View 'Threadfear / Ask Me to Stay'",
        "Route": "/releases/threadfear-ask-me-to-stay"
      },
      "CreatedAt": "2017-11-03T00:00:00"
    },
    {
      "Title": "Single 'Witchlust / Rev 22:20' released",
      "Author": "Viii",
      "Excerpt": "New single 'Witchlust' released with accompanying B-side, 'Rev 22:20'.",
      "ImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/single-witchlust-rev-22-20-released.jpg",
      "Content": "<p>\nThe music artist of gothic electronica known as Viii has released his second pair of singles for 2017, titled, “Witchlust / Rev 22:20.” The tracks have been proudly published on the Voodoo Creation Records independent music label, along with the rest of the Viii catalog. Bringing the dark, suave sound fans of Viii have come to expect in spades, “Witchlust / Rev 22:20” is the latest reason fans of goth and electronica have to sit up and take notice of this shadowy studio project in 2017.\n</p>\n<p>\nViii (pronounced ‘Vee’) cites as main artistic influences Maynard James Keenan (Tool, A Perfect Circle) Crosses, Banks, Nine Inch Nails, Portishead, Massive Attack, and Prince. In fact, the single’s B-side, “Rev 22:20,” is a cover tune of an original track by Puscifer, headed by the legendary Maynard Keenan. This is the second such arrangment for Viii, whose recent “Lovedecay” single came bundled with a B-side cover of “Lovesong” by the Cure.\n</p>\n<p>\nAsked to describe the themes of his latest single, “Witchlust,” Viii writes, “Witchlust is a song where the protagonist is seduced and manipulated by a girl, going against his morals and becoming a person he hates. After falling and committing to the relationship completely, he is then discarded and left unable to fully connect with future romantic partners – becoming as cold and heartless as the girl that transformed him was.”\n</p>\n<p>\nThe Puscifer cover, “Rev 22:20” makes an erotic play on the prominent Bible verse which begins, “I am coming quickly.” It moves from here to describe a sexual obsession with a beautiful woman who is damaging to the narrator, who implores the listener to refrain from falling under her spell. In this way, the track braids seamlessly with the situation described in “Witchlust.”\n</p>\n<p>\n“Witchlust / Rev 22:20” by Viii becomes available 2 June 2017 from over 700 quality digital music stores online worldwide.\n</p>\n<p>\n-S. McCauley<br />\nLead Press Release Writer<br />\nMondoTunes\n</p>\n<p><a href=\"/releases/witchlust-rev-22-20\">View the single details here</a>.</p>",
      "OgImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/og/single-witchlust-rev-22-20-released.jpg",
      "Slug": "single-witchlust-rev-22-20-released",
      "IsActive": "y",
      "Type": "release",
      "Action": {
        "Text": "View 'Witchlust / Rev 22:20'",
        "Route": "/releases/witchlust-rev-22-20"
      },
      "CreatedAt": "2017-06-02T00:00:00"
    },
    {
      "Title": "Single 'Heavens to Elizabeth' released",
      "Author": "Viii",
      "Excerpt": "Special single 'Heavens to Elizabeth' released to celebrate New Zealand Music Month.",
      "ImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/heavens-to-elizabeth-released.jpg",
      "Content": "<p>A special single, <em>Heavens to Elizabeth</em>, has been released to celebrate New Zealand Music Month 2017. This is a modern take on a song originally performed by Viii's father's band, <em>Hanging Tree</em>, in the early '90s.</p><p><a href=\"/releases/heavens-to-elizabeth\">View the single details here</a>.</p>",
      "OgImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/og/heavens-to-elizabeth-released.jpg",
      "Slug": "heavens-to-elizabeth-released",
      "IsActive": "y",
      "Type": "release",
      "Action": {
        "Text": "View 'Heavens to Elizabeth'",
        "Route": "/releases/heavens-to-elizabeth"
      },
      "CreatedAt": "2017-05-16T00:00:00"
    },
    {
      "Title": "Debut single 'Lovedecay / Lovesong' released",
      "Author": "Viii",
      "Excerpt": "Debut single 'Lovedecay' released with accompanying B-side, 'Lovesong'.",
      "ImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/debut-single-lovedecay-lovesong-released.jpg",
      "Content": "<p>\nThe performer and producer of goth electronica known as Viii has released his latest single, “Lovedecay,” with companion B-side, “Lovesong.” The twin release has been proudly published on the Voodoo Creation Records independent music label without the involvement of the corporate music industry. Mellow, sensual, shadowy and techno-chic, “Lovedecay / Lovesong” is the most prominent release from Viii yet.\n</p>\n<p>\nViii, which is pronounced ‘Vee,’ cites as main artistic influences Maynard James Keenan (Tool, A Perfect Circle) Crosses, Banks, Nine Inch Nails, Portishead, Massive Attack, and Prince. His own material takes the softly thumping rhythms of Portishead and mixes in a dash of Massive Attack’s melody style, then tops the blend with vocals that are understated, elegant and sincere.\n</p>\n<p>\nAlso notable is that “Lovesong” is an electronica cover of the third single from the Cure’s “Disintegration” LP. Fans of the above groups are sure to be enthusiastic about “Lovedecay / Lovesong” from Viii.\n</p>\n<p>\nAsked to comment on the themes of “Lovedecay,” Viii writes, “’Lovedecay’ is a story of two lovers who know their relationship is close to an end. They are both extremely unhappy and are causing each other emotional harm in their reluctance to leave due to the fact that being without each other is a frightening unknown to them.”\n</p>\n<p>\nViii has referred to himself as “a painter of frequencies and thoughts channeling his views, experiences and surroundings into sonic creations of varying style.”\n</p>\n<p>\nHis current official bio describes him: “An artist raised in the music scene, Viii has been producing and engineering artists since 2005, as well as being involved with numerous projects of his own. Not content with fitting ideas into a predefined genre, he sought freedom under the moniker ‘Viii’ in 2016 and drew from his eclectic assortment of influences ranging from triphop, trap and pop, to industrial music, goth rock, and everything in between.”\n</p>\n<p>\nViii has said he plans to release several EP records over the course of 2017.\n</p>\n<p>\n“Lovedecay / Lovesong” by Viii are available online worldwide from over 700 quality digital music stores beginning 24 March 2017.\n</p>\n<p>\n-S. McCauley<br />\nLead Press Release Writer<br />\nMondoTunes\n</p>\n<p><a href=\"/releases/lovedecay-lovesong\">View the single details here</a>.</p>",
      "OgImageUrl": "https://s3.amazonaws.com/mynameisviii-static/news/og/debut-single-lovedecay-lovesong-released.jpg",
      "Slug": "debut-single-lovedecay-lovesong-released",
      "IsActive": "y",
      "Type": "release",
      "Action": {
        "Text": "View 'Lovedecay / Lovesong'",
        "Route": "/releases/lovedecay-lovesong"
      },
      "CreatedAt": "2017-03-24T00:00:00"
    }
  ],
  "Count": 6,
  "ScannedCount": 6
}
